## Date 29June2019

# Day Objectives

### Numpy Library

- Processing N - Dimensional arrays

In [ ]:
import numpy as np

li = [1,2,3,"z"]

a = np.array(li)

b = np.arange(15)

b

In [ ]:
m3 = np.random.randint(0,2,size=(3,3,3,3))
m3[2][2][2][1]

In [ ]:
m3.ndim
m3.size
m3.shape
m3.dtype
m3.itemsize
m3.nbytes

In [ ]:
print(b)

In [ ]:
c = b.reshape(5,3)
c

In [ ]:
import numpy as np
M = np.ones((3,3))
print("Matrix M:\n", M)

## Pandas

### Use cases

- Data Cleaning
- Data Transformation
- Data Analysis


### Notations

- Series
- DataFrames

In [10]:
import pandas as pd

mid1 = {"s1": 21, "s2":18, "s3":24}
mid1 = pd.Series(mid1)
mid1

mid2 = {"s1": 15, "s2":18, "s3":12}
mid2 = pd.Series(mid2)

mid2

s1    15
s2    18
s3    12
dtype: int64

In [21]:
final ={"internal1": mid1, "internal2": mid2}
final = pd.DataFrame(final)
final["internal1"]

s1    21
s2    18
s3    24
Name: internal1, dtype: int64

In [22]:
final

    internal1  internal2
s1         21         15
s2         18         18
s3         24         12

In [23]:
final.columns   # Names of all columns

Index(['internal1', 'internal2'], dtype='object')

In [24]:
 final.values   # List of all rows

array([[21, 15],
       [18, 18],
       [24, 12]], dtype=int64)

In [25]:
final.values[2]

array([24, 12], dtype=int64)

In [26]:
final.values[2,0] = 25
final.values[2][0]

25

In [27]:
for row in final.values:
    print("internal1 - ", row[0], "internal2 - ", row[1])

internal1 -  21 internal2 -  15
internal1 -  18 internal2 -  18
internal1 -  25 internal2 -  12

In [28]:
final

    internal1  internal2
s1         21         15
s2         18         18
s3         25         12

In [31]:
final.loc["3"] = [15,18]
final

    internal1  internal2
s1         21         15
s2         18         18
s3         25         12
s4         20         18
3          15         18

In [33]:
final.drop('3')

    internal1  internal2
s1         21         15
s2         18         18
s3         25         12
s4         20         18

In [34]:
final

    internal1  internal2
s1         21         15
s2         18         18
s3         25         12
s4         20         18
3          15         18

In [35]:
final = final.drop("3")
final

    internal1  internal2
s1         21         15
s2         18         18
s3         25         12
s4         20         18

In [36]:
final.values[2] = [12,25]
final

    internal1  internal2
s1         21         15
s2         18         18
s3         12         25
s4         20         18

In [43]:
# Reading csv file data

import pandas as pd

filepath = "DataFiles/income.csv"
incomedf = pd.read_csv(filepath)
incomedf

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [40]:
# Extract income of all states in 2013

# California: 57528

for row in incomedf.values:
    print(row[1], ":", row[-1])

Alabama : 41381
Alaska : 61137
Arizona : 50602
Arkansas : 39919
California : 57528

In [44]:
# Average income of Arizona

sum = 0
for i in range(2,11):
    sum += incomedf.values[2][i]
    
sum/len(incomedf.values[2][2:])

47214.77777777778

In [45]:
# Average income of all states in 2012

sum = 0

for row in incomedf.values:
    sum +=row[-2]
    
sum/len(incomedf.values)

50038.8